Import all required libraries

In [90]:
import numpy as np;
import pandas as pd;

Creation of dataset using MS excel and load the dataset into pandas dataframe

In [91]:
df=pd.read_csv("income.csv")

In [92]:
df

    Id  Age  Income               Occupation  Years of Experience
0    1   24   34000             Accountant                     10
1    2   31   32000      Software Engineer                      9
2    3   32   62000                 Doctor                      2
3    4   24   70000                Teacher                      5
4    5   24   65000                 Lawyer                      2
5    6   30   46000              Architect                      8
6    7   29   41000       Graphic Designer                      2
7    8   31   34000           Data Analyst                      5
8    9   35   69000                  Nurse                      7
9   10   30   35000            Electrician                     10
10  11   28   44000                Plumber                     10
11  12   34   36000    Mechanical Engineer                      3
12  13   28   30000         Civil Engineer                      6
13  14   30   39000         Police Officer                      4
14  15   31   66000                   Chef                      8
15  16   25   48000             Pharmacist                      7
16  17   25   49000                Dentist                      6
17  18   30   30000          Web Developer                      1
18  19   34   64000      Marketing Manager                      8
19  20   24   52000             HR Manager                      4
20  21   35   44000                  Pilot                      6
21  22   35   38000              Scientist                      6
22  23   26   45000             Journalist                     10
23  24   25   56000      Financial Analyst                      8
24  25   24   45000  Cybersecurity Analyst                      8
25  26   30   52000             Biochemist                      7
26  27   26   58000                 Artist                      5
27  28   30   65000     Software Developer                      4
28  29   29   60000    Business Consultant                      8
29  30   35   45000        Sales Executive                      6

Data Preprocessing

In [93]:
df.head()

   Id  Age  Income           Occupation  Years of Experience
0   1   24   34000         Accountant                     10
1   2   31   32000  Software Engineer                      9
2   3   32   62000             Doctor                      2
3   4   24   70000            Teacher                      5
4   5   24   65000             Lawyer                      2

In [94]:
df.tail()

    Id  Age  Income             Occupation  Years of Experience
25  26   30   52000           Biochemist                      7
26  27   26   58000               Artist                      5
27  28   30   65000   Software Developer                      4
28  29   29   60000  Business Consultant                      8
29  30   35   45000      Sales Executive                      6

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Id                   30 non-null     int64
 1   Age                  30 non-null     int64
 2   Income               30 non-null     int64
 3   Occupation           30 non-null     object
 4   Years of Experience  30 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.3+ KB

In [96]:
df.describe()

              Id        Age        Income  Years of Experience
count  30.000000  30.000000     30.000000            30.000000
mean   15.500000  29.133333  48466.666667             6.166667
std     8.803408   3.775907  12478.210894             2.600840
min     1.000000  24.000000  30000.000000             1.000000
25%     8.250000  25.250000  38250.000000             4.250000
50%    15.500000  30.000000  45500.000000             6.000000
75%    22.750000  31.000000  59500.000000             8.000000
max    30.000000  35.000000  70000.000000            10.000000

In [97]:
df.shape

(30, 5)

In [98]:
df[0:3]

   Id  Age  Income           Occupation  Years of Experience
0   1   24   34000         Accountant                     10
1   2   31   32000  Software Engineer                      9
2   3   32   62000             Doctor                      2

In [99]:
df.loc[0:2]

   Id  Age  Income           Occupation  Years of Experience
0   1   24   34000         Accountant                     10
1   2   31   32000  Software Engineer                      9
2   3   32   62000             Doctor                      2

In [100]:
df.iloc[0:3]

   Id  Age  Income           Occupation  Years of Experience
0   1   24   34000         Accountant                     10
1   2   31   32000  Software Engineer                      9
2   3   32   62000             Doctor                      2

In [101]:
df.iloc[2:6,1:3]

   Age  Income
2   32   62000
3   24   70000
4   24   65000
5   30   46000

In [102]:
df.isnull()

       Id    Age  Income  Occupation  Years of Experience
0   False  False   False       False                False
1   False  False   False       False                False
2   False  False   False       False                False
3   False  False   False       False                False
4   False  False   False       False                False
5   False  False   False       False                False
6   False  False   False       False                False
7   False  False   False       False                False
8   False  False   False       False                False
9   False  False   False       False                False
10  False  False   False       False                False
11  False  False   False       False                False
12  False  False   False       False                False
13  False  False   False       False                False
14  False  False   False       False                False
15  False  False   False       False                False
16  False  False   False       False                False
17  False  False   False       False                False
18  False  False   False       False                False
19  False  False   False       False                False
20  False  False   False       False                False
21  False  False   False       False                False
22  False  False   False       False                False
23  False  False   False       False                False
24  False  False   False       False                False
25  False  False   False       False                False
26  False  False   False       False                False
27  False  False   False       False                False
28  False  False   False       False                False
29  False  False   False       False                False

In [103]:
df.isna().sum()

Id                     0
Age                    0
Income                 0
Occupation             0
Years of Experience    0
dtype: int64

In [104]:
df.isna().any()

Id                     False
Age                    False
Income                 False
Occupation             False
Years of Experience    False
dtype: bool

In [105]:
df.dtypes

Id                      int64
Age                     int64
Income                  int64
Occupation             object
Years of Experience     int64
dtype: object

In [106]:
df.columns

Index(['Id', 'Age', 'Income', 'Occupation', 'Years of Experience'], dtype='object')

Descriptive statistics

In [107]:
print(df.Age.describe())
print(df.Income.describe())

count    30.000000
mean     29.133333
std       3.775907
min      24.000000
25%      25.250000
50%      30.000000
75%      31.000000
max      35.000000
Name: Age, dtype: float64
count       30.000000
mean     48466.666667
std      12478.210894
min      30000.000000
25%      38250.000000
50%      45500.000000
75%      59500.000000
max      70000.000000
Name: Income, dtype: float64

Mean

In [108]:
print(df.Age.mean())
print(df.Income.mean())

29.133333333333333
48466.666666666664

Median

In [109]:
print(df.Age.median())
print(df.Income.median())

30.0
45500.0

STD

In [110]:
print(df.Age.std())
print(df.Income.std())

3.775906681098967
12478.21089445265

Min

In [111]:
print(df.Age.min())
print(df.Income.min())

24
30000

In [112]:
df.min()

Id                                1
Age                              24
Income                        30000
Occupation             Accountant
Years of Experience               1
dtype: object

Max

In [113]:
df.max()

Id                                  30
Age                                 35
Income                           70000
Occupation             Web Developer
Years of Experience                 10
dtype: object

In [114]:
print(df.Age.max())
print(df.Income.max())

35
70000

Range

In [115]:
print(df.Age.max()- df.Age.min())
print(df.Income.max() - df.Income.min())

11
40000

Variance

In [116]:
df.var()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13076\1568254755.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var()

Id                     7.750000e+01
Age                    1.425747e+01
Income                 1.557057e+08
Years of Experience    6.764368e+00
dtype: float64

In [117]:
df.var(axis=1)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13076\3811919735.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var(axis=1)

0     2.888018e+08
1     2.557762e+08
2     9.606179e+08
3     1.224615e+09
4     1.055914e+09
5     5.286628e+08
6     4.199905e+08
7     2.887509e+08
8     1.189664e+09
9     3.059585e+08
10    4.836408e+08
11    3.237062e+08
12    2.247651e+08
13    3.799382e+08
14    1.088406e+09
15    5.756161e+08
16    5.998581e+08
17    2.247552e+08
18    1.023350e+09
19    6.755841e+08
20    4.835456e+08
21    3.606013e+08
22    5.058076e+08
23    7.834682e+08
24    5.058227e+08
25    6.754542e+08
26    8.404395e+08
27    1.055579e+09
28    8.993402e+08
29    5.057178e+08
dtype: float64

In [118]:
print(df.Age.var())
print(df.Income.var())

14.257471264367817
155705747.1264368

Mode

In [119]:
print(df.Age.mode())
print(df.Income.mode())

0    30
Name: Age, dtype: int64
0    45000
Name: Income, dtype: int64

In [120]:
df.groupby('Age')['Income'].describe()

     count     mean           std      min      25%      50%      75%      max
Age
24     5.0  53200.0  14652.644812  34000.0  45000.0  52000.0  65000.0  70000.0
25     3.0  51000.0   4358.898944  48000.0  48500.0  49000.0  52500.0  56000.0
26     2.0  51500.0   9192.388155  45000.0  48250.0  51500.0  54750.0  58000.0
28     2.0  37000.0   9899.494937  30000.0  33500.0  37000.0  40500.0  44000.0
29     2.0  50500.0  13435.028843  41000.0  45750.0  50500.0  55250.0  60000.0
30     6.0  44500.0  12723.993084  30000.0  36000.0  42500.0  50500.0  65000.0
31     3.0  44000.0  19078.784028  32000.0  33000.0  34000.0  50000.0  66000.0
32     1.0  62000.0           NaN  62000.0  62000.0  62000.0  62000.0  62000.0
34     2.0  50000.0  19798.989873  36000.0  43000.0  50000.0  57000.0  64000.0
35     4.0  49000.0  13686.976778  38000.0  42500.0  44500.0  51000.0  69000.0

In [121]:
#df.groupby('Gender')['Income'].describe()

In [122]:
iris=pd.read_csv("Iris.csv")

In [123]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [124]:
iris.describe(include='all')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
count,150.000000,150.000000,150.000000,150.000000,150.000000,150
unique,NaN,NaN,NaN,NaN,NaN,3
top,NaN,NaN,NaN,NaN,NaN,Iris-setosa
freq,NaN,NaN,NaN,NaN,NaN,50
mean,75.500000,5.843333,3.054000,3.758667,1.198667,NaN
std,43.445368,0.828066,0.433594,1.764420,0.763161,NaN
min,1.000000,4.300000,2.000000,1.000000,0.100000,NaN
25%,38.250000,5.100000,2.800000,1.600000,0.300000,NaN
50%,75.500000,5.800000,3.000000,4.350000,1.300000,NaN
75%,112.750000,6.400000,3.300000,5.100000,1.800000,NaN
max,150.000000,7.900000,4.400000,6.900000,2.500000,NaN

In [125]:
iris.shape

(150, 6)

In [126]:
iris.isnull()

        Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0    False          False         False          False         False    False
1    False          False         False          False         False    False
2    False          False         False          False         False    False
3    False          False         False          False         False    False
4    False          False         False          False         False    False
..     ...            ...           ...            ...           ...      ...
145  False          False         False          False         False    False
146  False          False         False          False         False    False
147  False          False         False          False         False    False
148  False          False         False          False         False    False
149  False          False         False          False         False    False

[150 rows x 6 columns]

In [127]:
iris.isna()

        Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0    False          False         False          False         False    False
1    False          False         False          False         False    False
2    False          False         False          False         False    False
3    False          False         False          False         False    False
4    False          False         False          False         False    False
..     ...            ...           ...            ...           ...      ...
145  False          False         False          False         False    False
146  False          False         False          False         False    False
147  False          False         False          False         False    False
148  False          False         False          False         False    False
149  False          False         False          False         False    False

[150 rows x 6 columns]

In [128]:
iris.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [129]:
iris.isnull().any()

Id               False
SepalLengthCm    False
SepalWidthCm     False
PetalLengthCm    False
PetalWidthCm     False
Species          False
dtype: bool

In [130]:
iris.SepalLengthCm.isnull().sum()

0

In [131]:
iris.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [132]:
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

Descriptive statistics

In [133]:
col_names=['Sepal_Length','Sepal_Width',"Petal_Length",'Petal_Width','Species']

In [134]:
irisSet=(iris['Species']=='Iris-setosa')

In [135]:
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [136]:
irisVer=(iris['Species']=='Iris-versicolor')

In [137]:
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [138]:
irisVir=(iris['Species']=='Iris-virginica')

In [139]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000

In [140]:
print(iris.SepalLengthCm.describe())
print(iris.SepalWidthCm.describe())
print(iris.PetalLengthCm.describe())
print(iris.PetalWidthCm.describe())

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: SepalLengthCm, dtype: float64
count    150.000000
mean       3.054000
std        0.433594
min        2.000000
25%        2.800000
50%        3.000000
75%        3.300000
max        4.400000
Name: SepalWidthCm, dtype: float64
count    150.000000
mean       3.758667
std        1.764420
min        1.000000
25%        1.600000
50%        4.350000
75%        5.100000
max        6.900000
Name: PetalLengthCm, dtype: float64
count    150.000000
mean       1.198667
std        0.763161
min        0.100000
25%        0.300000
50%        1.300000
75%        1.800000
max        2.500000
Name: PetalWidthCm, dtype: float64

In [141]:
#mean
print(iris.SepalLengthCm.mean())
print(iris.SepalWidthCm.mean())
print(iris.PetalLengthCm.mean())
print(iris.PetalWidthCm.mean())

5.843333333333334
3.0540000000000003
3.758666666666666
1.1986666666666668

In [142]:
#median
print(iris.SepalLengthCm.median())
print(iris.SepalWidthCm.median())
print(iris.PetalLengthCm.median())
print(iris.PetalWidthCm.median())

5.8
3.0
4.35
1.3

In [143]:
#standard deviation 
iris.std()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13076\3849825860.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [144]:
print(iris.SepalLengthCm.std())
print(iris.SepalWidthCm.std())
print(iris.PetalLengthCm.std())
print(iris.PetalWidthCm.std())

0.8280661279778629
0.4335943113621737
1.7644204199522617
0.7631607417008414

In [145]:
#min
iris.min()

Id                         1
SepalLengthCm            4.3
SepalWidthCm             2.0
PetalLengthCm            1.0
PetalWidthCm             0.1
Species          Iris-setosa
dtype: object

In [146]:
print(iris.SepalLengthCm.min())
print(iris.SepalWidthCm.min())
print(iris.PetalLengthCm.min())
print(iris.PetalWidthCm.min())

4.3
2.0
1.0
0.1

In [147]:
#max
iris.max()

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [148]:
print(iris.SepalLengthCm.max())
print(iris.SepalWidthCm.max())
print(iris.PetalLengthCm.max())
print(iris.PetalWidthCm.max())

7.9
4.4
6.9
2.5

In [149]:
#range
print(iris.SepalLengthCm.max()-iris.SepalLengthCm.min())
print(iris.SepalWidthCm.max()-iris.SepalWidthCm.min())
print(iris.PetalLengthCm.max()-iris.PetalLengthCm.min())
print(iris.PetalWidthCm.max()-iris.PetalWidthCm.min())

3.6000000000000005
2.4000000000000004
5.9
2.4

In [150]:
#variance
iris.var()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13076\2384711547.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.var()

Id               1887.500000
SepalLengthCm       0.685694
SepalWidthCm        0.188004
PetalLengthCm       3.113179
PetalWidthCm        0.582414
dtype: float64

In [151]:
iris.var(axis=1)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_13076\3127413591.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.var(axis=1)

0         4.043
1         3.140
2         3.077
3         3.287
4         4.688
         ...
145    4018.843
146    4097.323
147    4140.268
148    4188.578
149    4268.783
Length: 150, dtype: float64

In [152]:
print(iris.SepalLengthCm.var())
print(iris.SepalWidthCm.var())
print(iris.PetalLengthCm.var())
print(iris.PetalWidthCm.var())

0.6856935123042505
0.18800402684563763
3.1131794183445156
0.5824143176733784

In [153]:
#percentile
print(iris.SepalLengthCm.quantile(0.25))
print(iris.SepalWidthCm.quantile(0.25))
print(iris.PetalLengthCm.quantile(0.25))
print(iris.PetalWidthCm.quantile(0.25))

5.1
2.8
1.6
0.3

In [154]:
print(iris.SepalLengthCm.quantile(0.50))
print(iris.SepalWidthCm.quantile(0.50))
print(iris.PetalLengthCm.quantile(0.50))
print(iris.PetalWidthCm.quantile(0.50))

5.8
3.0
4.35
1.3

In [155]:
print(iris.SepalLengthCm.quantile(0.75))
print(iris.SepalWidthCm.quantile(0.75))
print(iris.PetalLengthCm.quantile(0.75))
print(iris.PetalWidthCm.quantile(0.75))

6.4
3.3
5.1
1.8

In [156]:
#Skewness
print(iris.SepalLengthCm.skew())
print(iris.SepalWidthCm.skew())
print(iris.PetalLengthCm.skew())
print(iris.PetalWidthCm.skew())

0.3149109566369728
0.3340526621720866
-0.27446425247378287
-0.10499656214412734

In [157]:
print((3*(iris.SepalLengthCm.mean()-iris.SepalLengthCm.median()))/(iris.SepalLengthCm.std()))

0.1569922927743242

In [158]:
#mode
print(iris.Species.mode())

0        Iris-setosa
1    Iris-versicolor
2     Iris-virginica
Name: Species, dtype: object

In [159]:
print(iris.SepalLengthCm.mode())

0    5.0
Name: SepalLengthCm, dtype: float64